Repository: AChep/keyguard-app
Catalog: appleUi/Sources/KeyguardUI/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, hu, it, ja, ko, pt_br, pt_pt, ru, uk, zh_hans

# gpg_agent_setup_step_1_text
source: Open GPG settings, enable GPG agent, and make sure the vault contains a GPG key the agent is allowed to use.
ar: افتح إعدادات GPG، وفعّل وكيل GPG، وتأكد من أن الخزنة تحتوي على مفتاح GPG يُسمح للوكيل باستخدامه.
de: Öffnen Sie die GPG-Einstellungen, aktivieren Sie den GPG-Agenten und stellen Sie sicher, dass der Tresor einen GPG-Schlüssel enthält, den der Agent verwenden darf.
es: Abra la configuración de GPG, habilite el agente GPG y asegúrese de que la caja fuerte contenga una clave GPG que el agente pueda usar.
fr: Ouvrez les paramètres GPG, activez l'agent GPG et assurez-vous que le coffre-fort contient une clé GPG que l'agent est autorisé à utiliser.
it: Apri le impostazioni GPG, abilita l'agente GPG e assicurati che la cassaforte contenga una chiave GPG che l'agente è autorizzato a utilizzare.
ja: GPG 設定を開いて GPGエージェントを有効にし、エージェントが使用を許可された GPG キーが保管庫に含まれていることを確認します。
ko: GPG 설정을 열어 GPG 에이전트를 켜고, 에이전트가 사용할 수 있는 GPG 키가 보관함에 있는지 확인하세요.
pt_br: Abra as configurações do GPG, habilite o agente GPG e certifique-se de que o cofre contenha uma chave GPG que o agente tenha permissão para usar.
pt_pt: Abra as definições do GPG, ative o agente GPG e certifique-se de que o cofre contém uma chave GPG que o agente tem permissão para utilizar.
ru: Откройте настройки GPG, включите GPG-агент и убедитесь, что в хранилище есть GPG-ключ, который агенту разрешено использовать.
uk: Відкрийте налаштування GPG, увімкніть GPG-агент і переконайтеся, що сховище містить GPG-ключ, який агенту дозволено використовувати.
zh_hans: 打开 GPG 设置，启用 GPG 代理，并确保密码库中包含代理允许使用的 GPG 密钥。

# gpg_agent_setup_step_1_title
source: 1. Enable GPG agent in Keyguard
ar: 1. تفعيل وكيل GPG في Keyguard
de: 1. GPG-Agenten in Keyguard aktivieren
es: 1. Habilitar el agente GPG en Keyguard
fr: 1. Activer l'agent GPG dans Keyguard
it: 1. Abilita l'agente GPG su Keyguard
ja: 1. Keyguard で GPGエージェントを有効化
ko: 1. Keyguard에서 GPG 에이전트 켜기
pt_br: 1. Habilite o agente GPG no Keyguard
pt_pt: 1. Active o agente GPG no Keyguard
ru: 1. Включите GPG-агент в Keyguard
uk: 1. Увімкніть GPG-агент у Keyguard
zh_hans: 1. 在 Keyguard 中启用 GPG 代理

# gpg_agent_setup_step_2_text
source: Run GnuPG commands from a shell that points to Keyguard's agent home. Keyguard listens on the agent socket that GnuPG resolves for this home.
ar: شغّل أوامر GnuPG من صدفة تشير إلى مجلد وكيل Keyguard. يستمع Keyguard إلى مقبس الوكيل الذي يحلّه GnuPG لهذا المجلد.
de: Führen Sie GnuPG-Befehle in einer Shell aus, die auf das Agenten-Home-Verzeichnis von Keyguard verweist. Keyguard lauscht am Agenten-Socket, den GnuPG für dieses Home-Verzeichnis auflöst.
es: Ejecute comandos de GnuPG desde una shell que apunte al directorio del agente de Keyguard. Keyguard escucha en el socket del agente que GnuPG resuelve para este directorio.
fr: Exécutez les commandes GnuPG depuis un shell qui pointe vers le répertoire d'agent de Keyguard. Keyguard écoute sur le socket d'agent que GnuPG résout pour ce répertoire.
it: Esegui i comandi GnuPG da una shell che punta alla home dell'agente di Keyguard. Keyguard è in ascolto sul socket dell'agente che GnuPG risolve per questa home.
ja: Keyguard のエージェントホームを指すシェルから GnuPG コマンドを実行します。Keyguard は、このホームに対して GnuPG が解決するエージェントソケットで待ち受けます。
ko: Keyguard의 에이전트 홈을 가리키는 셸에서 GnuPG 명령어를 실행하세요. Keyguard는 GnuPG가 이 홈에 대해 결정한 에이전트 소켓에서 요청을 수신합니다.
pt_br: Execute comandos GnuPG a partir de um shell que aponta para a página inicial do agente do Keyguard. O Keyguard escuta no S.gpg-agent dentro deste diretório.
pt_pt: Execute comandos GnuPG a partir de um shell que aponte para o diretório raiz do agente Keyguard. O Keyguard estará a escutar no socket do agente que o GnuPG resolve para esse directório raiz.
ru: Выполняйте команды GnuPG из оболочки, указывающей на домашний каталог агента Keyguard. Keyguard слушает сокет агента, который GnuPG определяет для этого каталога.
uk: Виконуйте команди GnuPG з оболонки, яка вказує на домашню теку агента Keyguard. Keyguard слухає сокет агента, який GnuPG визначає для цієї домашньої теки.
zh_hans: 在指向 Keyguard 代理主目录的终端中运行 GnuPG 命令。Keyguard 会监听 GnuPG 为该主目录解析的代理套接字（Socket）。

# gpg_agent_setup_step_2_title
source: 2. Configure GNUPGHOME
ar: 2. إعداد GNUPGHOME
de: 2. GNUPGHOME konfigurieren
es: 2. Configurar GNUPGHOME
fr: 2. Configurer GNUPGHOME
it: 2. Configura GNUPGHOME
ja: 2. GNUPGHOME を設定
ko: 2. GNUPGHOME 설정
pt_br: 2. Configure o GNUPGHOME
pt_pt: 2. Configure o GNUPGHOME
ru: 2. Настройте GNUPGHOME
uk: 2. Налаштуйте GNUPGHOME
zh_hans: 2. 配置 GNUPGHOME

# gpg_agent_setup_step_3_text
source: Export the public key from the GPG Key item in Keyguard, then import it into this GnuPG home. This exposes only public key material.
ar: صدّر المفتاح العام من عنصر مفتاح GPG في Keyguard، ثم استورده إلى مجلد GnuPG هذا. لا يكشف هذا سوى مادة المفتاح العام.
de: Exportieren Sie den öffentlichen Schlüssel aus dem GPG-Schlüssel-Element in Keyguard und importieren Sie ihn dann in dieses GnuPG-Home-Verzeichnis. Dabei wird nur öffentliches Schlüsselmaterial offengelegt.
es: Exporte la clave pública desde el elemento de clave GPG en Keyguard y luego impórtela en este directorio de GnuPG. Esto solo expone material de clave pública.
fr: Exportez la clé publique depuis l'élément Clé GPG dans Keyguard, puis importez-la dans ce répertoire GnuPG. Cela n'expose que le matériel de clé publique.
it: Esporta la chiave pubblica dall'elemento Chiave GPG in Keyguard, quindi importala in questa home GnuPG. Questo espone solo il materiale della chiave pubblica.
ja: Keyguard の GPG キーアイテムから公開鍵をエクスポートし、この GnuPG ホームにインポートします。これにより公開鍵の情報のみが公開されます。
ko: Keyguard의 GPG 키 항목에서 공개 키를 내보낸 다음, 이 GnuPG 홈으로 가져오세요. 이 과정에서는 공개 키 자료만 노출됩니다.
pt_br: Exporte a chave pública do item Chave GPG no Keyguard e importe-a para esta página inicial do GnuPG. Isso expõe apenas material de chave pública.
pt_pt: Exporte a chave pública do item Chave GPG no Keyguard e, em seguida, importe-a para este diretório GnuPG. Isto expõe apenas o material da chave pública.
ru: Экспортируйте открытый ключ из записи GPG-ключа в Keyguard, затем импортируйте его в этот домашний каталог GnuPG. При этом раскрывается только материал открытого ключа.
uk: Експортуйте відкритий ключ із запису GPG-ключа в Keyguard, а потім імпортуйте його в цю домашню теку GnuPG. Це розкриває лише дані відкритого ключа.
zh_hans: 从 Keyguard 的 GPG 密钥条目中导出公钥，然后将其导入到此 GnuPG 主目录中。此操作仅会公开公钥材料。

# gpg_agent_setup_step_3_title
source: 3. Import the public key
ar: 3. استيراد المفتاح العام
de: 3. Öffentlichen Schlüssel importieren
es: 3. Importar la clave pública
fr: 3. Importer la clé publique
it: 3. Importa la chiave pubblica
ja: 3. 公開鍵をインポート
ko: 3. 공개 키 가져오기
pt_br: 3. Importe a chave pública
pt_pt: 3. Importe a chave pública
ru: 3. Импортируйте открытый ключ
uk: 3. Імпортуйте відкритий ключ
zh_hans: 3. 导入公钥

# gpg_agent_setup_step_4_text
source: List Keyguard-visible keys, then sign a short message. Replace YOUR_KEY_FINGERPRINT with the fingerprint from the imported key.
ar: اعرض المفاتيح المرئية لـ Keyguard، ثم وقّع رسالة قصيرة. استبدل YOUR_KEY_FINGERPRINT بالبصمة من المفتاح المستورد.
de: Listen Sie die für Keyguard sichtbaren Schlüssel auf und signieren Sie dann eine kurze Nachricht. Ersetzen Sie YOUR_KEY_FINGERPRINT durch den Fingerabdruck des importierten Schlüssels.
es: Liste las claves visibles para Keyguard y luego firme un mensaje corto. Reemplace YOUR_KEY_FINGERPRINT con la huella digital de la clave importada.
fr: Listez les clés visibles par Keyguard, puis signez un court message. Remplacez YOUR_KEY_FINGERPRINT par l'empreinte de la clé importée.
it: Elenca le chiavi visibili a Keyguard, quindi firma un breve messaggio. Sostituisci YOUR_KEY_FINGERPRINT con l'impronta digitale della chiave importata.
ja: Keyguard で参照可能なキーを一覧表示し、短いメッセージに署名します。YOUR_KEY_FINGERPRINT は、インポートしたキーのフィンガープリントに置き換えてください。
ko: Keyguard에 표시되는 키 목록을 조회한 다음, 짧은 메시지에 서명하세요. YOUR_KEY_FINGERPRINT를 가져온 키의 핑거프린트로 바꾸세요.
pt_br: Liste as chaves visíveis do Keyguard e assine uma mensagem curta. Substitua YOUR_KEY_FINGERPRINT pela impressão digital da chave importada.
pt_pt: Liste as chaves visíveis no Keyguard e, em seguida, assine uma breve mensagem. Substitua YOUR_KEY_FINGERPRINT pela impressão digital da chave importada.
ru: Выведите список ключей, видимых Keyguard, затем подпишите короткое сообщение. Замените YOUR_KEY_FINGERPRINT на отпечаток импортированного ключа.
uk: Виведіть список ключів, видимих для Keyguard, а потім підпишіть коротке повідомлення. Замініть YOUR_KEY_FINGERPRINT на відбиток імпортованого ключа.
zh_hans: 列出 Keyguard 可见的密钥，然后尝试签名一段简短文字。请将 YOUR_KEY_FINGERPRINT 替换为已导入密钥的指纹。

# gpg_agent_setup_step_4_title
source: 4. Verify
ar: 4. التحقق
de: 4. Überprüfen
es: 4. Verificar
fr: 4. Vérifier
it: 4. Verifica
ja: 4. 確認
ko: 4. 확인
pt_br: 4. Verificar
pt_pt: 4. Verificar
ru: 4. Проверка
uk: 4. Перевірка
zh_hans: 4. 验证

# gpg_agent_setup_step_5_text
source: Use the same GNUPGHOME when Git signs commits. Keep the config local to one repository, or change --local to --global.
ar: استخدم نفس GNUPGHOME عندما يوقّع Git الالتزامات. أبقِ الإعداد محليًا لمستودع واحد، أو غيّر --local إلى --global.
de: Verwenden Sie dasselbe GNUPGHOME, wenn Git Commits signiert. Halten Sie die Konfiguration lokal in einem Repository oder ändern Sie --local zu --global.
es: Use el mismo GNUPGHOME cuando Git firme commits. Mantenga la configuración local para un solo repositorio o cambie --local por --global.
fr: Utilisez le même GNUPGHOME lorsque Git signe des commits. Gardez la configuration locale à un seul dépôt, ou remplacez --local par --global.
it: Utilizza lo stesso GNUPGHOME quando Git firma i commit. Mantieni la configurazione locale a un singolo repository oppure cambia --local in --global.
ja: Git がコミットに署名する際も同じ GNUPGHOME を使用します。設定は 1 つのリポジトリにローカルなまま保つか、--local を --global に変更してください。
ko: Git이 커밋에 서명할 때도 같은 GNUPGHOME을 사용하세요. 설정을 하나의 저장소에만 적용하려면 로컬로 두고, 전역으로 적용하려면 --local을 --global로 바꾸세요.
pt_br: Use o mesmo GNUPGHOME quando o Git assinar commits. Mantenha a configuração local em um repositório ou altere --local para --global.
pt_pt: Utilize o mesmo GNUPGHOME quando o Git assina commits. Mantenha a configuração local para um repositório ou altere --local para --global.
ru: Используйте тот же GNUPGHOME, когда Git подписывает коммиты. Оставьте конфигурацию локальной для одного репозитория или замените --local на --global.
uk: Використовуйте той самий GNUPGHOME, коли Git підписує коміти. Зберігайте конфігурацію локальною для одного репозиторію або змініть --local на --global.
zh_hans: 在 Git 签名提交时使用相同的 GNUPGHOME。您可以将配置保留在当前仓库，也可以将 --local 改为 --global 全局生效。

# gpg_agent_setup_step_5_title
source: 5. Sign Git commits
ar: 5. توقيع التزامات Git
de: 5. Git-Commits signieren
es: 5. Firmar commits de Git
fr: 5. Signer les commits Git
it: 5. Firma i commit Git
ja: 5. Git コミットに署名
ko: 5. Git 커밋 서명
pt_br: 5. Assine os commits do Git
pt_pt: 5. Assinar commits do Git
ru: 5. Подписывайте коммиты Git
uk: 5. Підписуйте коміти Git
zh_hans: 5. 签名 Git 提交

# gpg_agent_setup_unsupported_text
source: The GPG agent is only available in the desktop version of Keyguard.
ar: وكيل GPG متاح فقط في نسخة سطح المكتب من Keyguard.
de: Der GPG-Agent ist nur in der Desktop-Version von Keyguard verfügbar.
es: El agente GPG solo está disponible en la versión de escritorio de Keyguard.
fr: L'agent GPG n'est disponible que dans la version de bureau de Keyguard.
it: L'agente GPG è disponibile solo nella versione desktop di Keyguard.
ja: GPGエージェントはデスクトップ版の Keyguard でのみ利用できます。
ko: GPG 에이전트는 Keyguard 데스크톱 버전에서만 사용할 수 있습니다.
pt_br: O agente GPG está disponível apenas na versão desktop do Keyguard.
pt_pt: O agente GPG está apenas disponível na versão desktop do Keyguard.
ru: GPG-агент доступен только в настольной версии Keyguard.
uk: GPG-агент доступний лише в десктопній версії Keyguard.
zh_hans: GPG 代理仅在 Keyguard 桌面版中可用。

# gpg_agent_setup_windows_native_gnupg_note
source: Windows requires a native GnuPG installation. The GPG bundled with Git for Windows is not compatible with this setup.
ar: يتطلب Windows تثبيتًا أصليًا لـ GnuPG. إن GPG المضمّن مع Git for Windows غير متوافق مع هذا الإعداد.
de: Windows erfordert eine native GnuPG-Installation. Das mit Git für Windows gelieferte GPG ist mit dieser Konfiguration nicht kompatibel.
es: Windows requiere una instalación nativa de GnuPG. El GPG incluido con Git para Windows no es compatible con esta configuración.
fr: Windows nécessite une installation native de GnuPG. Le GPG fourni avec Git pour Windows n'est pas compatible avec cette configuration.
it: Windows richiede un'installazione nativa di GnuPG. Il GPG incluso in Git per Windows non è compatibile con questa configurazione.
ja: Windows では個別の GnuPG インストールが必要です。Git for Windows に同梱される GPG は、このセットアップとは互換性がありません。
ko: Windows에서는 자체 GnuPG 설치가 필요합니다. Git for Windows에 포함된 GPG는 이 설정과 호환되지 않습니다.
pt_br: O Windows requer uma instalação nativa do GnuPG. O GPG incluído no Git for Windows não é compatível com esta configuração.
pt_pt: O Windows requer uma instalação nativa do GnuPG. O GPG incluído no Git para Windows não é compatível com esta configuração.
ru: Для Windows требуется отдельная установка GnuPG. Версия GPG, входящая в состав Git для Windows, несовместима с этой настройкой.
uk: Windows потребує окремого встановлення GnuPG. GPG, що постачається разом із Git для Windows, несумісний із цим налаштуванням.
zh_hans: Windows 系统需要安装原生 GnuPG。Git for Windows 自带的 GPG 与此配置不兼容。

source: GPG client request
ar: طلب عميل GPG
de: GPG-Client-Anfrage
es: Solicitud del cliente GPG
fr: Requête du client GPG
it: Richiesta del client GPG
ja: GPGクライアントリクエスト
ko: GPG 클라이언트 요청
pt_br: Solicitação de cliente GPG
pt_pt: Pedido do cliente GPG
ru: Запрос от GPG-клиента
uk: Запит від GPG-клієнта
zh_hans: GPG 客户端请求

# gpg_key_action_save_public_key_saved_downloads_success_title
source: GPG public key saved to Downloads
ar: تم حفظ المفتاح العام لـ GPG في التنزيلات
de: Öffentlicher GPG-Schlüssel in Downloads gespeichert
es: Clave pública GPG guardada en Descargas
fr: Clé publique GPG enregistrée dans les téléchargements
it: Chiave pubblica GPG salvata nei Download
ja: GPG 公開鍵をダウンロードに保存しました
ko: GPG 공개 키를 다운로드 폴더에 저장했습니다.
pt_br: Chave pública GPG salva em Downloads
pt_pt: Chave pública GPG guardada em Downloads
ru: Открытый GPG-ключ сохранён в папку Загрузки
uk: Відкритий ключ GPG збережено в теку Завантаження
zh_hans: GPG 公钥已保存至“下载”目录

# gpg_key_action_save_public_key_title
source: Save public key
ar: حفظ المفتاح العام
de: Öffentlichen Schlüssel speichern
es: Guardar clave pública
fr: Enregistrer la clé publique
it: Salva chiave pubblica
ja: 公開鍵を保存
ko: 공개 키 저장
pt_br: Salvar chave pública
pt_pt: Guardar chave pública
ru: Сохранить открытый ключ
uk: Зберегти відкритий ключ
zh_hans: 保存公钥

# gpg_key_action_save_unencrypted_keys_saved_downloads_success_title
source: GPG keys saved to Downloads
ar: تم حفظ مفاتيح GPG في التنزيلات
de: GPG-Schlüssel in Downloads gespeichert
es: Claves GPG guardadas en Descargas
fr: Clés GPG enregistrées dans les téléchargements
it: Chiavi GPG salvate nei Download
ja: GPG キーをダウンロードに保存しました
ko: GPG 키를 다운로드 폴더에 저장했습니다.
pt_br: Chaves GPG salvas em downloads
pt_pt: Chaves GPG guardadas em Downloads
ru: GPG-ключи сохранены в папку Загрузки
uk: Ключі GPG збережено в теку Завантаження
zh_hans: GPG 密钥已保存至“下载”目录

# gpg_key_action_save_unencrypted_keys_title
source: Save unencrypted keys
ar: حفظ المفاتيح غير المشفّرة
de: Unverschlüsselte Schlüssel speichern
es: Guardar claves sin cifrar
fr: Enregistrer les clés non chiffrées
it: Salva chiavi non crittografate
ja: 暗号化されていないキーを保存
ko: 암호화되지 않은 키 저장
pt_br: Salvar chaves não criptografadas
pt_pt: Guardar chaves não encriptadas
ru: Сохранить незашифрованные ключи
uk: Зберегти незашифровані ключі
zh_hans: 保存未加密的密钥

# gpg_key_action_save_unencrypted_private_key_saved_downloads_success_title
source: Unencrypted GPG private key saved to Downloads
ar: تم حفظ المفتاح الخاص غير المشفّر لـ GPG في التنزيلات
de: Unverschlüsselter privater GPG-Schlüssel in Downloads gespeichert
es: Clave privada GPG sin cifrar guardada en Descargas
fr: Clé privée GPG non chiffrée enregistrée dans les téléchargements
it: Chiave privata GPG in chiaro salvata nei Download
ja: 暗号化されていない GPG 秘密鍵をダウンロードに保存しました
ko: 암호화되지 않은 GPG 개인 키를 다운로드 폴더에 저장했습니다.
pt_br: Chave privada GPG não criptografada salva em Downloads
pt_pt: Chave privada GPG não encriptada guardada em Downloads
ru: Незашифрованный секретный GPG-ключ сохранён в папку Загрузки
uk: Незашифрований секретний ключ GPG збережено в теку Завантаження
zh_hans: 未加密的 GPG 私钥已保存至“下载”目录

# gpg_key_action_save_unencrypted_private_key_title
source: Save unencrypted private key
ar: حفظ المفتاح الخاص غير المشفّر
de: Unverschlüsselter privater Schlüssel speichern
es: Guardar la clave privada sin cifrar
fr: Enregistrer la clé privée non chiffrée
it: Salva chiave privata in chiaro
ja: 暗号化されていない秘密鍵を保存
ko: 암호화되지 않은 개인 키 저장
pt_br: Salvar chave privada não criptografada
pt_pt: Guardar chave privada não encriptada
ru: Сохранить незашифрованный секретный ключ
uk: Зберегти незашифрований секретний ключ
zh_hans: 保存未加密的私钥

# gpg_key_capability_encrypt_decrypt
source: Encrypt/decrypt
ar: تشفير/فك تشفير
de: Verschlüsseln/Entschlüsseln
es: Cifrar/descifrar
fr: Chiffrer/déchiffrer
it: Crittografia/decrittografia
ja: 暗号化・復号
ko: 암호화/복호화
pt_br: Criptografar/descriptografar
pt_pt: Encriptar/desencriptar
ru: Шифрование/расшифровка
uk: Шифрування/розшифрування
zh_hans: 加密 / 解密

# gpg_key_does_not_expire
source: Does not expire
ar: لا تنتهي صلاحيته
de: Läuft nicht ab
es: No caduca
fr: N'expire pas
it: Non scade
ja: 有効期限なし
ko: 만료되지 않음
pt_br: Não expira
pt_pt: Não expira
ru: Не истекает
uk: Не має терміну дії
zh_hans: 永不过期

# gpg_key_expiry_after_primary_message
source: A subkey cannot remain usable after the primary key expires. Select the primary key too or choose an earlier expiry.
ar: لا يمكن أن يظل المفتاح الفرعي صالحًا بعد انتهاء صلاحية المفتاح الأساسي. حدّد المفتاح الأساسي أيضًا أو اختر تاريخ انتهاء أبكر.
de: Ein Unterschlüssel kann nach Ablauf des Hauptschlüssels nicht mehr verwendet werden. Wählen Sie auch den Hauptschlüssel aus oder wählen Sie ein früheres Ablaufdatum.
es: Una subclave no puede seguir siendo válida después de que caduque la clave primaria. Seleccione también la clave primaria o elija una fecha de caducidad anterior.
fr: Une sous-clé ne peut pas rester utilisable après l'expiration de la clé principale. Sélectionnez également la clé principale ou choisissez une date d'expiration antérieure.
it: Una sottochiave non può rimanere utilizzabile dopo la scadenza della chiave primaria. Seleziona anche la chiave primaria oppure scegli una scadenza precedente.
ja: サブキーはプライマリキーの有効期限が切れた後は使用できません。プライマリキーも選択するか、より早い有効期限を選んでください。
ko: 하위 키는 기본 키가 만료된 후에는 사용할 수 없습니다. 기본 키도 함께 선택하거나 더 이른 만료일을 선택하세요.
pt_br: Uma subchave não pode permanecer utilizável depois que a chave primária expirar. Selecione também a chave primária ou escolha uma validade anterior.
pt_pt: Uma sub-chave não pode permanecer utilizável após a expiração da chave primária. Selecione também a chave primária ou escolha uma data de expiração anterior.
ru: Подключ не может оставаться пригодным к использованию после истечения срока действия основного ключа. Выберите также основной ключ или задайте более ранний срок действия.
uk: Підключ не може залишатися придатним після завершення терміну дії основного ключа. Виберіть також основний ключ або вкажіть ранішу дату завершення.
zh_hans: 主密钥过期后，子密钥将无法继续使用。请同时选择主密钥，或选择更早的过期时间。

# gpg_key_expiry_capability_encrypt
source: encrypt
ar: تشفير
de: verschlüsseln
es: cifrar
fr: chiffrer
it: crittografia
ja: 暗号化
ko: 암호화
pt_br: criptografar
pt_pt: encriptar
ru: шифрование
uk: шифрування
zh_hans: 加密

# gpg_key_expiry_capability_sign
source: sign
ar: توقيع
de: signieren
es: firmar
fr: signer
it: firma
ja: 署名
ko: 서명
pt_br: assinar
pt_pt: assinar
ru: подпись
uk: підпис
zh_hans: 签名

# gpg_key_expiry_cipher_success_message
source: The item was updated. Redistribute or upload its public key.
ar: تم تحديث العنصر. أعد توزيع مفتاحه العام أو ارفعه.
de: Das Element wurde aktualisiert. Verteilen Sie seinen öffentlichen Schlüssel neu oder laden Sie ihn hoch.
es: El elemento se ha actualizado. Redistribuya o suba su clave pública.
fr: L'élément a été mis à jour. Redistribuez ou téléversez sa clé publique.
it: L'elemento è stato aggiornato. Ridistribuisci o carica la sua chiave pubblica.
ja: アイテムを更新しました。公開鍵を再配布するかアップロードしてください。
ko: 항목이 업데이트되었습니다. 공개 키를 재배포하거나 업로드하세요.
pt_br: O item foi atualizado. Redistribua ou envie sua chave pública.
pt_pt: O item foi atualizado. Redistribua ou faça o upload da chave pública.
ru: Запись обновлена. Распространите или загрузите её открытый ключ.
uk: Запис оновлено. Поширте повторно або завантажте його відкритий ключ.
zh_hans: 该条目已更新。请重新分发或上传其公钥。

# gpg_key_expiry_dialog_message
source: Expiration is reversible and does not protect a compromised key. Revoke a compromised key instead.
ar: انتهاء الصلاحية قابل للعكس ولا يحمي مفتاحًا مخترقًا. أبطل المفتاح المخترق بدلاً من ذلك.
de: Der Ablauf ist umkehrbar und schützt einen kompromittierten Schlüssel nicht. Widerrufen Sie stattdessen einen kompromittierten Schlüssel.
es: La caducidad es reversible y no protege una clave comprometida. En su lugar, revoque una clave comprometida.
fr: L'expiration est réversible et ne protège pas une clé compromise. Révoquez plutôt une clé compromise.
it: La scadenza è reversibile e non protegge una chiave compromessa. Revoca invece una chiave compromessa.
ja: 有効期限の変更は元に戻せますが、漏洩したキーを保護するものではありません。漏洩したキーは失効させてください。
ko: 만료는 되돌릴 수 있으며 유출된 키를 보호하지 못합니다. 유출된 키는 대신 폐기하세요.
pt_br: A expiração é reversível e não protege uma chave comprometida. Em vez disso, revogue uma chave comprometida.
pt_pt: A expiração é reversível e não protege uma chave comprometida. Em vez disso, revogue a chave comprometida.
ru: Истечение срока действия обратимо и не защищает скомпрометированный ключ. Вместо этого отзовите скомпрометированный ключ.
uk: Зміна терміну дії є зворотною й не захищає скомпрометований ключ. Натомість відкличте скомпрометований ключ.
zh_hans: 设置过期时间是可逆的，且无法保护已泄露的密钥。如果密钥已泄露，请将其吊销。

# gpg_key_expiry_dialog_title
source: Change GPG key expiry
ar: تغيير تاريخ انتهاء مفتاح GPG
de: GPG-Schlüsselablauf ändern
es: Cambiar la caducidad de la clave GPG
fr: Modifier l'expiration de la clé GPG
it: Modifica la scadenza della chiave GPG
ja: GPG キーの有効期限を変更
ko: GPG 키 만료 변경
pt_br: Alterar validade da chave GPG
pt_pt: Alterar a data de expiração da chave GPG
ru: Изменить срок действия GPG-ключа
uk: Змінити термін дії GPG-ключа
zh_hans: 修改 GPG 密钥过期时间

# gpg_key_expiry_failed_message
source: The key expiry could not be updated. The original key was left unchanged.
ar: تعذّر تحديث تاريخ انتهاء المفتاح. تُرك المفتاح الأصلي دون تغيير.
de: Der Schlüsselablauf konnte nicht aktualisiert werden. Der ursprüngliche Schlüssel wurde nicht verändert.
es: No se pudo actualizar la caducidad de la clave. La clave original permaneció sin cambios.
fr: L'expiration de la clé n'a pas pu être mise à jour. La clé d'origine est restée inchangée.
it: Impossibile aggiornare la scadenza della chiave. La chiave originale è rimasta invariata.
ja: キーの有効期限を更新できませんでした。元のキーは変更されていません。
ko: 키 만료를 업데이트하지 못했습니다. 원본 키는 변경되지 않았습니다.
pt_br: Não foi possível atualizar a validade da chave. A chave original permaneceu inalterada.
pt_pt: Não foi possível atualizar a data de expiração da chave. A chave original permaneceu inalterada.
ru: Не удалось обновить срок действия ключа. Исходный ключ остался без изменений.
uk: Не вдалося оновити термін дії ключа. Оригінальний ключ залишився без змін.
zh_hans: 无法更新密钥过期时间。原始密钥保持不变。
